import imgCer1 from "../assets/certificate/1.png";
import imgCer2 from "../assets/certificate/2.png";
import imgCer3 from "../assets/certificate/3.png";
import imgCer4 from "../assets/certificate/4.png";
import imgCer5 from "../assets/certificate/5.png";
import imgCer6 from "../assets/certificate/6.png";
import imgCer7 from "../assets/certificate/7.png";
import imgCer8 from "../assets/certificate/8.png";
import imgCer9 from "../assets/certificate/9.png";
import imgCer10 from "../assets/certificate/10.png";
import imgCer11 from "../assets/certificate/11.png";
import imgCer12 from "../assets/certificate/12.png";
import imgCer13 from "../assets/certificate/13.png";
import imgCer14 from "../assets/certificate/14.jpg";

import info1 from "../assets/infopic/1111.png";
import info2 from "../assets/infopic/2222.png";
// import info3 from '../assets/infopic/3333.png'
import info4 from "../assets/infopic/4444.png";

import exp1 from '../assets/exp/image (6).png'
import exp2 from '../assets/exp/image (5).png'
import exp3 from '../assets/exp/image (4).png'
import exp4 from '../assets/exp/image (3).png'
import exp5 from '../assets/exp/image (2).png'
import exp6 from '../assets/exp/image (10).png'
import exp7 from '../assets/exp/image (9).png'

export const servicesTH = [
  {
    title: "FACEBOOK",
    image: info1,
    link: "https://www.facebook.com/MosT5140?locale=th_TH",
    p: "👋 สวัสดี! ยินดีต้อนรับสู่บัญชีของผม ผมชื่อ นายฉัตรคุปต์ กลิ่นอุบล และนี่คือที่ที่ผมไว้แบ่งปันเรื่องราว ความคิด และประสบการณ์ของผมกับพวกคุณทุกคน",
  },
  {
    title: "GITHUB",
    image: info2,
    link: "https://github.com/ChattakhupK",
    p: "ผมเป็นนักพัฒนาที่หลงใหลใน web development, full stack, ฯลฯ ที่นี่คุณจะพบกับโปรเจ็กต์และผลงานของผมที่สะท้อนถึงการเดินทางในการเขียนโค้ดและความคิดสร้างสรรค์ของผม",
  },
  // {
  //   title: "TIKTOK",
  //   image: info3,
  //   link: "https://www.tiktok.com/@bugsbunnychinese",
  //   p: "ยินดีต้อนรับสู่ช่อง TikTok ของผม! นี่คือที่ที่ผมแบ่งปันความคิดสร้างสรรค์และความสนุกสนานทุกวันผ่านคลิปสั้นๆ ที่เต็มไปด้วยแรงบันดาลใจ",
  // },
  {
    title: "PORTFOLIO",
    image: info4,
    link: "https://files.fm/f/dxdz5zaggq",
    p: "ผมหวังว่าผลงานนี้จะทำให้คุณทราบถึงทักษะและความสามารถของผม หากคุณสนใจที่จะร่วมงานกับผมหรือมีคำถามเพิ่มเติม สามารถติดต่อผมได้เลย",
  },
];
export const experiencesTH = [
  {
    title: "Web-HTML-BMI",
    link: "https://chattakhupk.github.io/BMI.github.io/",
    code_name: "HTML | CSS | JAVASCRIPT",
    iconBg: "#383E56",
    icon: exp1,
    date: "ธันวาคม  2023 - มกราคม  2024",
    points: [
      "เว็บไซต์เครื่องคำนวณดัชนีมวลกาย (BMI) ใช้งานง่ายโดยใช้ HTML, CSS และ JavaScript ขั้นแรก คุณต้องตั้งค่าโครงสร้าง HTML ที่ให้ผู้ใช้ป้อนน้ำหนักและส่วนสูง จากนั้น คุณใช้ CSS เพื่อจัดรูปแบบหน้าเว็บให้ดูสะอาดตาและใช้งานง่าย สุดท้าย คุณเขียน JavaScript เพื่อคำนวณดัชนีมวลกาย (BMI) ตามอินพุตและแสดงผลลัพธ์ รวมถึงตรวจสอบอินพุตที่ถูกต้องเพื่อให้แน่ใจว่าได้ผลลัพธ์ที่ถูกต้อง",
    ],
  },
  {
    title: "FIGMA-LINEMAN-DESIGN-UI",
    link: "https://www.figma.com/proto/ucgxJ2WNQtmOaykdQA9NVU/LINE-MAN-A1?node-id=25-1754&starting-point-node-id=25%3A914",
    code_name: "FIGMA",
    iconBg: "#383E56",
    icon: exp2,
    date: "กุมภาพันธ์  2024 - มีนาคม  2024",
    points: [
      `
การออกแบบแอปสั่งอาหารโดยใช้ Figma ช่วยให้ทีมงานสามารถสร้างโครงร่างและภาพที่เป็นมิตรต่อผู้ใช้ ในขณะเดียวกันก็ทดสอบประสบการณ์ของผู้ใช้ก่อนการพัฒนาแอปจริงได้อย่างมีประสิทธิภาพ`,
    ],
  },
  {
    title: "FIGMA-WebPrimus-DESIGN-UI",
    link: "https://www.figma.com/proto/GCkUVVkyGJbLA6y0RGekCY/Web-Primus-Test?node-id=0-1&node-type=canvas&t=3qRC90leUBoqD0uO-0&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1",
    code_name: "FIGMA",
    iconBg: "#383E56",
    icon: exp3,
    date: "มีนาคม  2024 - เมษายน  2024",
    points: [
      `
การสร้างเว็บไซต์องค์กรโดยใช้ Figma เกี่ยวข้องกับขั้นตอนสำคัญหลายขั้นตอน ขั้นแรก ให้กำหนดวัตถุประสงค์ของเว็บไซต์และกลุ่มเป้าหมาย ขั้นต่อไป ให้ออกแบบโครงร่างเพื่อกำหนดเค้าโครงขององค์ประกอบต่างๆ เช่น เมนูและส่วนเนื้อหา จากนั้น ให้เน้นที่การออกแบบ UI โดยเลือกสี แบบอักษร และรูปภาพที่สอดคล้องกับแบรนด์`,
    ],
  },
  {
    title: "Web-Board",
    link: "https://github.com/ChattakhupK/chatRoom-app.git",
    code_name: "HTML | CSS | Handlebars | JAVASCRIPT | Mysql",
    iconBg: "#383E56",
    icon: exp4,
    date: "สิงหาคม  2024 - กันยายน  2024",
    points: [
      "การสร้างกระทู้สนทนาสามารถทำได้โดยใช้ HTML, CSS, Handlers และ MySQL ขั้นตอนนี้เริ่มต้นด้วยการออกแบบโครงสร้างเว็บเพจโดยใช้ HTML เพื่อเพิ่มแบบฟอร์มสำหรับโพสต์หัวข้อใหม่และส่วนสำหรับแสดงหัวข้อที่มีอยู่ จากนั้นจึงใช้ CSS เพื่อปรับปรุงความน่าสนใจและประสบการณ์การใช้งานของไซต์ Handlers ทำหน้าที่เป็นเครื่องมือสร้างเทมเพลต ซึ่งช่วยให้สามารถแสดงผลหัวข้อที่ดึงมาจากฐานข้อมูล MySQL ได้อย่างไดนามิก ซึ่งจัดเก็บข้อมูล เช่น ชื่อเรื่องและเนื้อหา JavaScript ใช้เพื่ออำนวยความสะดวกในการสื่อสารระหว่างแบบฟอร์มและฐานข้อมูล MySQL ช่วยให้ผู้ใช้สามารถสร้างและอ่านหัวข้อได้อย่างราบรื่นบนเว็บไซต์",
    ],
  },
  {
    title: "CRUD-User-Realtime",
    link: "https://mylistadd-firebase-c7ezmd4vl-chattakhupks-projects.vercel.app/",
    code_name: "React | Tailwind | Firebase | Node",
    iconBg: "#383E56",
    icon: exp5,
    date: "กันยายน  2024 - ตุลาคม  2024",
    points: [
      "การสร้างเว็บไซต์ CRUD (Create, Read, Update, Delete) โดยใช้ React, Tailwind CSS และ Firebase ถือเป็นวิธีที่มีประสิทธิภาพในการพัฒนาแอปพลิเคชันที่จัดการข้อมูลอย่างครอบคลุม React ช่วยให้สร้างอินเทอร์เฟซผู้ใช้แบบโต้ตอบได้สูง ในขณะที่ Tailwind CSS ช่วยให้ออกแบบได้อย่างรวดเร็วและสวยงาม Firebase ทำหน้าที่เป็นฐานข้อมูลแบบเรียลไทม์และบริการจัดการผู้ใช้ ช่วยให้สามารถเพิ่ม แก้ไข อ่าน และลบข้อมูลได้อย่างราบรื่น ด้วยการรวมเทคโนโลยีเหล่านี้เข้าด้วยกัน นักพัฒนาสามารถปรับกระบวนการสร้างแอปพลิเคชัน CRUD ที่แข็งแกร่งได้อย่างมีประสิทธิภาพ",
    ],
  },
  {
    title: "Chat-Auth-Realtime",
    link: "https://realtime-chat-app-98d9c.web.app/",
    code_name: "React | Tailwind | Firebase | Node",
    iconBg: "#383E56",
    icon: exp6,
    date: "กันยายน  2024 - ตุลาคม  2024",
    points: [
      "การสร้างเว็บไซต์แชทโดยใช้ React, Tailwind CSS และ Firebase เป็นวิธีที่ทันสมัยและมีประสิทธิภาพในการสร้างแพลตฟอร์มการสื่อสารแบบเรียลไทม์ React มอบอินเทอร์เฟซผู้ใช้แบบตอบสนองและโต้ตอบได้ ในขณะที่ Tailwind CSS ช่วยให้จัดรูปแบบได้อย่างรวดเร็วและปรับแต่งได้ Firebase จัดการส่วนแบ็คเอนด์ โดยนำเสนอความสามารถฐานข้อมูลแบบเรียลไทม์และการตรวจสอบผู้ใช้ ซึ่งทำให้การจัดการข้อความแชทและเซสชันของผู้ใช้เป็นเรื่องง่าย ด้วยการผสานรวมเทคโนโลยีเหล่านี้ นักพัฒนาสามารถสร้างประสบการณ์การแชทที่ราบรื่นและน่าดึงดูดสำหรับผู้ใช้",
    ],
  },
  {
    title: "E-commerce",
    link: "https://github.com/ChattakhupK/ECOM-STORE-REACT-MYSQL",
    code_name: "React | Tailwind | Node | Express | Mysql | Stripe",
    iconBg: "#383E56",
    icon: exp7,
    date: "ตุลาคม  2024 - ปัจจุบัน",
    points: [
      "การสร้างเว็บไซต์อีคอมเมิร์ซเพื่อขายอุปกรณ์คอมพิวเตอร์โดยใช้เทคโนโลยีสมัยใหม่ เช่น React, Node.js, Express และ MySQL เริ่มต้นด้วยการวางแผนวัตถุประสงค์และฟีเจอร์ที่ต้องการ เช่น การค้นหาผลิตภัณฑ์และระบบตะกร้าสินค้า จากนั้นออกแบบ UI/UX ด้วยไวร์เฟรมหรือโมเดลจำลองเพื่อให้มั่นใจว่าใช้งานง่าย จากนั้นพัฒนาแบ็คเอนด์โดยใช้ Node.js และ Express เพื่อสร้าง API สำหรับจัดการข้อมูลผลิตภัณฑ์ สำหรับฟรอนต์เอนด์ ให้ใช้ React เพื่อสร้างอินเทอร์เฟซผู้ใช้ที่ตอบสนองได้ และจัดการฐานข้อมูลผลิตภัณฑ์ของคุณด้วย MySQL เมื่อการพัฒนาเสร็จสิ้น ให้ทดสอบฟังก์ชันการทำงานของเว็บไซต์และทำการปรับปรุงที่จำเป็น",
    ],
  },
];

export const certificateTH = [
  {
    cer: imgCer1,
  },
  {
    cer: imgCer2,
  },
  {
    cer: imgCer3,
  },
  {
    cer: imgCer4,
  },
  {
    cer: imgCer5,
  },
  {
    cer: imgCer6,
  },
  {
    cer: imgCer7,
  },
  {
    cer: imgCer8,
  },
  {
    cer: imgCer9,
  },
  {
    cer: imgCer10,
  },
  {
    cer: imgCer11,
  },
  {
    cer: imgCer12,
  },
  {
    cer: imgCer13,
  },
  {
    cer: imgCer14,
  },
];
